[
  {
    "id": "6",
    "title": "The Pragmatic Programmer",
    "author": "Andrew Hunt",
    "genre": "Programming",
    "description": "A guide to pragmatic software development.",
    "year": 1999,
    "imageUrl": "https://example.com/cover.jpg",
    "isAvailable": true
  },
  {
    "id": "dc392bc2-dd72-4e69-a086-942f2755a89d",
    "title": "Whispers of the Forest",
    "author": "Jane Smith",
    "genre": "Fantasy",
    "description": "Whispers of the Forest is a mesmerizing fantasy novel that transports readers into the heart of an ancient woodland brimming with magic, mystery, and timeless lore. When Elara, a reclusive young apothecary, follows the faint call of a forgotten melody into the trees, she discovers a realm where spirits stir, legends breathe, and her own destiny has already taken root. As the forest reveals its secrets and a long-dormant power begins to rise, Elara must face ancient trials, forge unlikely alliances, and embrace a legacy written in the leaves. Jane Smith’s lyrical prose and richly imagined world will enchant fans of atmospheric fantasy and magical realism alike.",
    "year": 2019,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/255/large_6cacd912f898ca2f94d083737783e23e.jpg",
    "isAvailable": false
  },
  {
    "id": "28af69c0-535b-4ad1-85c7-a82fe3f9a9ea",
    "title": "The Big Bird",
    "author": "John Doe",
    "genre": "Fiction",
    "description": "The Big Bird is a captivating fiction novel that weaves mystery, adventure, and suspense into a gripping narrative. Set in a quiet coastal town, the story follows a young ornithologist who becomes obsessed with tracking down a legendary, elusive bird said to possess otherworldly powers.",
    "year": 2021,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/254/large_f9aca907606b40f478a4ec40ade5f476.jpg",
    "isAvailable": false
  },
  {
    "id": "e55ca4ec-367d-44db-b0a1-e0a454d52687",
    "title": "The Next Big Thing",
    "author": "Andrew McLinden",
    "genre": "Fantasy",
    "description": "The Next Big Thing is a mesmerizing fantasy novel that transports readers into the heart of an ancient woodland brimming with magic, mystery, and timeless lore. When Elara, a reclusive young apothecary, follows the faint call of a forgotten melody into the trees, she discovers a realm where spirits stir, legends breathe, and her own destiny has already taken root. As the forest reveals its secrets and a long-dormant power begins to rise, Elara must face ancient trials, forge unlikely alliances, and embrace a legacy written in the leaves. Jane Smith’s lyrical prose and richly imagined world will enchant fans of atmospheric fantasy and magical realism alike.",
    "year": 2009,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/244/large_71a53ec3dd63ffa1a3f906332dfc9a36.jpg",
    "isAvailable": true
  },
  {
    "id": "00680f1e-5d3d-49fa-b730-4815a54c877f",
    "title": "Shadow Legacy",
    "author": "Collen Mitchel",
    "description": "Shadow Legacy is a mesmerizing fantasy novel that transports readers into the heart of an ancient woodland brimming with magic, mystery, and timeless lore. When Elara, a reclusive young apothecary, follows the faint call of a forgotten melody into the trees, she discovers a realm where spirits stir, legends breathe, and her own destiny has already taken root. As the forest reveals its secrets and a long-dormant power begins to rise, Elara must face ancient trials, forge unlikely alliances, and embrace a legacy written in the leaves. Jane Smith’s lyrical prose and richly imagined world will enchant fans of atmospheric fantasy and magical realism alike.",
    "year": 2014,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/243/large_aac235d8c6d0232f15f704f949acc20e.jpeg",
    "isAvailable": false
  },
  {
    "id": "2f23c3b2-88f6-49d6-98a7-622a6233ae17",
    "title": "Fire and Flourishing",
    "author": "Kassi Wilson",
    "description": "Fire and FLourishing is a mesmerizing fantasy novel that transports readers into the heart of an ancient woodland brimming with magic, mystery, and timeless lore. When Elara, a reclusive young apothecary, follows the faint call of a forgotten melody into the trees, she discovers a realm where spirits stir, legends breathe, and her own destiny has already taken root. As the forest reveals its secrets and a long-dormant power begins to rise, Elara must face ancient trials, forge unlikely alliances, and embrace a legacy written in the leaves. Jane Smith’s lyrical prose and richly imagined world will enchant fans of atmospheric fantasy and magical realism alike.",
    "year": 1999,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/242/large_94f20234909a9edf1b11d7757aab2a44.jpg",
    "isAvailable": true
  },
  {
    "id": "386f0feb-36f8-47dd-ad2f-953906ffc347",
    "title": "The Rules We Live By",
    "author": "Destyn Land",
    "description": "The Rules We Live By is a mesmerizing fantasy novel that transports readers into the heart of an ancient woodland brimming with magic, mystery, and timeless lore. When Elara, a reclusive young apothecary, follows the faint call of a forgotten melody into the trees, she discovers a realm where spirits stir, legends breathe, and her own destiny has already taken root. As the forest reveals its secrets and a long-dormant power begins to rise, Elara must face ancient trials, forge unlikely alliances, and embrace a legacy written in the leaves. Jane Smith’s lyrical prose and richly imagined world will enchant fans of atmospheric fantasy and magical realism alike.",
    "year": 2005,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/240/large_005db42bd95a4acf4d81fa0d278781aa.jpg",
    "isAvailable": true
  },
  {
    "id": "342aa096-2c6c-4945-b659-9b0fd7189335",
    "title": "The Premed Paradox",
    "author": "Amit Pandey",
    "description": "The Premed Paradox is a mesmerizing fantasy novel that transports readers into the heart of an ancient woodland brimming with magic, mystery, and timeless lore. When Elara, a reclusive young apothecary, follows the faint call of a forgotten melody into the trees, she discovers a realm where spirits stir, legends breathe, and her own destiny has already taken root. As the forest reveals its secrets and a long-dormant power begins to rise, Elara must face ancient trials, forge unlikely alliances, and embrace a legacy written in the leaves. Jane Smith’s lyrical prose and richly imagined world will enchant fans of atmospheric fantasy and magical realism alike.",
    "year": 1993,
    "imageUrl": "https://blog-cdn.reedsy.com/directories/gallery/239/large_52f64c105935c75881ac2b956098df12.jpg",
    "isAvailable": true
  }
]